# SQL Commands Glossary - An Overview of 24 Most Popular SQL Commands

## What is SQL?

#### Instructions
> Provide a short sentence that explains how to use SELECT statements. And provide a simple example of SELECT in action. For example

## SQL Commands with examples

### 1. SELECT
SELECT statement is used to select data from a database table. In the below example, we are choosing all the columns from table **films** printing out the rows.

```SQL
SELECT * FROM films;
```

In this second example, we are choosing only certain columns instead of choosing all:

```SQL
SELECT movie_name, director 
FROM films;
```

### 2. LIMIT

The LIMIT command is used to crop the output of a SELECT statement. In the last SELECT statements, the outputs was all the rows in the table. Below, we limit the number to only 10 rows:

```SQL
SELECT *
FROM films
LIMIT 10;
```

### 3. AS

Sometimes, columns names can be too long and in a typical SQL statement, you might refer to the single column multiple times. To avoid typing the full name of the column every time, you can give it another shorter name called an alias using the AS keyword:

```SQL
SELECT movie_name AS name, release_date AS date
FROM films
LIMIT 5;
```

### 4. DISTINCT

Real world datasets often contain duplicate rows or values in a column. Vanilla SELECT statement ignores this but adding the DISTINCT keyword after it drops them:

```SQL
SELECT DISTINCT director
FROM films;
```

Above, we are selecting unique director names.

### 5. COUNT
As the name suggests, the COUNT keyword is used to count the output of the SELECT statement. For example, the below query counts the number of rows in the **films** table:

```SQL
SELECT COUNT(*)
FROM films;
```

Note that COUNT(col_name) is equivalent to COUNT(\*).

### 6-7. MIN and MAX

MIN and MAX functions return the smallest and largest values in a column. If a column is text, then it is sorted alphabetically:

```SQL
SELECT MIN(revenue) AS minimum_revenue,
       MAX(revenue) AS maximum_revenue
FROM films;
```

### 8. SUM

SUM returns the total value of a numeric column:

```SQL
SELECT SUM(revenue) AS total_revenue
FROM films;
```

### 9. AVERAGE
AVERAGE calculates the arithmetic mean of a column:

```SQL
SELECT AVERAGE(revenue) AS average_earned
FROM films;
```

### 10. WHERE
The WHERE clause is used to filter rows that match a certain condition. For example, below, we are filtering films that earned more than 500 million dollars:

```SQL
SELECT revenue AS r
FROM films
WHERE r > 500000000
```

Other conditional operators can be used such as <, >, =>, <=, == (equals), != (not equals) for filtering.

### 11. AND

AND operator is used to filter rows that match more than one condition at the same time. In the below example, we will filter for *English* films that grossed more than 500 million dollars:

```SQL
SELECT *
FROM films
WHERE revenue > 500000000 AND 
      language == "English"
```

### 12. OR

OR is another conditional operator that allows you to subset rows if any of the conditions separated by OR is true. For example, let's choose old English films that earned less than 100 million dollars or new ones that earned more than 500 million:

```SQL
SELECT * 
FROM films
WHERE (revenue < 100000000 AND language == "ENGLISH") OR
      (revenue > 500000000 AND release_date > 2020)
```

### 13. BETWEEN

BETWEEN is a handy keyword that allows you to subset rows that are within a certain range, which makes your WHERE clauses simpler and easier to read:

```SQL
SELECT *
FROM films
WHERE release_date BETWEEN 2010 AND 2022
```

In the example above, we are choosing all the films that were released between 2020 and 2022.

### 14. IN

Another great conditional operator is IN. The IN operator is a shorthand fur multiple OR statements. In the below example, we will choose all films that were released in either of these years - 1998, 1966, 2001, 2012:

```SQL
SELECT movie_name, release_date, revenue
FROM films
WHERE release_date IN (1998, 1966, 2001, 2012)
```

The IN operator works with text values as well.

### 15. LIKE

The LIKE operator makes it extremely easy to work with text columns. It is used to search for patterns in a text column using special strings called wildcards. For example, using "A% W%" wildcard on directors column will find all directors with first name starting with A and the last name starting with W:

```SQL
SELECT *
FROM films
WHERE director LIKE "A% W%";
```

The wildcard character "%" can be placed anywhere to match 0 or more characters. More examples are "n%t" (matches three letter words that start and end with n and t), "%k" (words that end in k), etc.

There are other wildcard characters in SQL. For a full list, visit this [link](https://www.w3schools.com/sql/sql_wildcards.asp).

### 16. GROUP BY
GROUP BY statement in SQL groups rows with the same values into summary rows. GROUP BY is usually used with aggregate functions like COUNT, MIN/MAX, AVERAGE. In the example below, we find the average revenue of each movie genre:

```SQL
SELECT AVERAGE(revenue), movie_name, director, release_date
FROM films
GROUP BY genre
```

We could have used MIN, MAX or COUNT(revenue) to find lowest, highest earning or the number of movies in each genre. Note that GROUP BY statement practically has no effect on the query if it isn't used with an aggregate function.

### 17. ORDER BY

As the name suggests, ORDER BY clause orders rows based on their value:

```SQL
SELECT *
FROM films
ORDER BY revenue;
```

You can order by multiple columns as well:

```SQL
SELECT *
FROM films
ORDER BY revenue, release_date;
```

You can order by ascending (default) or descending order by adding the ASC or DESC keywords after the column name.

### 18. UPDATE

UPDATE is used to change the values of individual cells in an existing table. It is used with the SET keyword in the following way:

```SQL
UPDATE films
SET director = "Joss Whedon"
WHERE director = "J. Whedon"
```

The WHERE clause is extremely important when writing UPDATE statements. Without it, the above query would have made all films directed by Joss Whedon.

### 19. ALTER TABLE

The ALTER TABLE statement can be used to modify properties of the table and its columns (not actual cell values). For example, changing column names, adding new columns, dropping them or changing their data type.

```SQL
ALTER TABLE films
DROP COLUMN release_date;
```

```SQL
ALTER TABLE films
ADD COLUMN age_rating;
```

### 20. CREATE TABLE

CREATE TABLE creates a new table in a database. Below, we are creating a "libraries" table with 4 columns - id, name, version, num_downloads:

```SQL
CREATE TABLE libraries (
    lib_id int,
    name varchar(100),
    version varchar(100),
    num_downloads int
)
```

After the CREATE TABLE statement, you specify the column names and their data type. `int` and `varchar(100)` are special SQL data type that represent integers and strings (with length specified).

### 21. INNER JOIN

The INNER JOIN command selects rows that have matching values in both tables. For example, in the query below, we are joining two tables on a common release_date column which returns films and soundtracks that were released in the same years:

```SQL
SELECT *
FROM films
INNER JOIN soundtracks
ON films.release_date = soundtracks.release_date
LIMIT 10;
```

### 22. LEFT JOIN

LEFT JOIN is an extension of an INNER JOIN that selects matching rows in both tables and the unmatching rows in the LEFT table:

```SQL
SELECT *
FROM films
LEFT JOIN soundtracks
ON films.release_date = soundtracks.release_date
LIMIT 10;
```

### 23. RIGHT JOIN

RIGHT JOIN is an extension of an INNER JOIN that selects matching rows in both tables and the unmatching rows in the RIGHT table:

```SQL
SELECT *
FROM films
LEFT JOIN soundtracks
ON films.release_date = soundtracks.release_date
LIMIT 10;
```

### 24. HAVING

HAVING clause is similar to WHERE clause but it can only be used with aggregate functions while WHERE can't. For example, in the below query, we are choosing all the movie genres that have at least 50 movies in their category:

```SQL
SELECT movie_name, director, release_date, COUNT(genre)
FROM films
GROUP BY genre
HAVING COUNT(genre) >= 50;
```

Here is another example that groups films by age rating and only chooses the ratings with average revenue over 100 million:

```SQL
SELECT movie_name, director, release_date, revenue
FROM films
GROUP BY age_rating
HAVING AVERAGE(genre) >= 100;
```

### 24. INSERT INTO

INSERT INTO statement can be used to add new rows to a table. Here is how to add a new movie to the films dataset:

```SQL
INSERT INTO films (movie_name, release_date, rating)
VALUES ("Doctor Strange 2", 2022, 7)
```

The above query only adds values to movie_name, release_date and rating columns. The rest of the columns for that row will be NULL. If you want to add values to all columns, you don't have to specify each column name. But, don't mix the order of the columns while providing values.

## SQL Commands Cheat Sheet

If you want an even shorter version of this article, use the [following excellent cheat sheet](https://www.datacamp.com/cheat-sheet/sql-basics-cheat-sheet).